---
title: 静态路由实验
date: 2022-05-18 15:22:15
permalink: /pages/038f63/
categories:
  - CCNA
tags:
  - 
author: 
  name: Xueliang
  link: https://github.com/Human0722
---
### 什么是路由器

路由器的主要功能是路由寻址和转发数据,是一个三层设备，工作在网络层。路由技术研究的是 `发送数据时寻找最佳的路径的过程`.需要注意的是，路由不是基于 IP 地址来转发，而是基于网络地址转发的。

### 静态路由配置命令
```shell
# 路由配置命令
Router(config) ip route 192.168.0.0 255.255.255.0 172.16.10.1
Router(config) ip route 192.168.0.0 255.255.0.0 172.16.10.1

# 端口 ip 配置命令
Router(config) interface f0/0
Router(config-if) ip add 192.168.31.2 255.255.255.0
Router(config-if) no shutdown
Router(config-if) exit
```

### 实验目标
![](https://raw.githubusercontent.com/Human0722/blogPics/master/20220518/图片.16s6ujaov3y8.webp)

### 实现过程

R1:
```shell
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.

Router(config)#interface f0/0
Router(config-if)#ip add 192.168.0.1 255.255.255.0
Router(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
Router(config-if)#exit

Router(config)#interface f0/1
Router(config-if)#ip add 172.16.0.1 255.255.255.0
Router(config-if)#no shutdown 
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
Router(config-if)#exit

Router(config)#ip route 172.16.1.0 255.255.255.0 172.16.0.2
Router(config)#ip route 192.168.1.0 255.255.255.0 172.16.0.2
```

R2: 
```shell
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.

Router(config)#interface f0/0
Router(config-if)#ip add 172.16.0.2 255.255.255.0
Router(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
Router(config-if)#exit

Router(config)#interface f0/1
Router(config-if)#ip add 172.16.1.1 255.255.255.0
Router(config-if)#no  shutdown 
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
Router(config-if)#exit

Router(config)#ip route 192.168.1.0 255.255.255.0 172.16.1.2
Router(config)#ip route 192.168.0.0 255.255.255.0 172.16.0.1
```

R3:
```shell
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface f0/0
Router(config-if)#ip add 172.16.1.2 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#interface f0/1
Router(config-if)#ip add 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

Router(config-if)#exit
Router(config)#ip route 172.16.0.0 255.255.255.0 172.16.1.1
Router(config)#ip route 192.168.0.0 255.255.255.0 172.16.1.1
```

PC1: 

![](https://raw.githubusercontent.com/Human0722/blogPics/master/20220518/图片.6lvtonf58sqo.webp)

PC2:  

![](https://raw.githubusercontent.com/Human0722/blogPics/master/20220518/图片.2waxvmshekao.webp)


### 查看配置的命令
```shell
Router#show ip route  			//查看路由表
Router#ip int brief			//查看接口IP地址
Router#ip route static 		//查看静态路由
Router(config)#no ip routing  //先关闭路由功能
Router(config)#ip routing     //然后再打开路由表
```




